v2206/MSc_icedAirfoil/Meshing_ice_2/+10deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47148;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47172;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47196;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47244;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23541;
        startFace       47292;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23541;
        startFace       70833;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          734;
        startFace       94374;
    }
)

// ************************************************************************* //
